In [1]:
#Practical 1 â€” Missing Data Handling

In [22]:
import pandas as pd
import numpy as np

In [23]:
data = {
    'id': list(range(1, 21)),
    'age': [24, 27, np.nan, 22, 25, 29, 31, np.nan, 23, 26,
            np.nan, 30, 28, 22, np.nan, 27, 25, 26, np.nan, 24],
    
    'salary': [45000, 54000, 50000, np.nan, 61000, 58000, np.nan,
               47000, 46000, np.nan, 52000, 60000, 58000,
               np.nan, 49000, 53000, np.nan, 52000, 56000, 48000],
    
    'city': ["Mumbai", "Delhi", "Bangalore", "Mumbai", np.nan, "Delhi", "Pune",
             "Delhi", "Mumbai", "Hyderabad", "Pune", "Mumbai", np.nan,
             "Chennai", "Kolkata", "Pune", "Mumbai", "Delhi", "Bangalore", np.nan]
}

In [24]:
df=pd.DataFrame(data)
df

    id   age   salary       city
0    1  24.0  45000.0     Mumbai
1    2  27.0  54000.0      Delhi
2    3   NaN  50000.0  Bangalore
3    4  22.0      NaN     Mumbai
4    5  25.0  61000.0        NaN
5    6  29.0  58000.0      Delhi
6    7  31.0      NaN       Pune
7    8   NaN  47000.0      Delhi
8    9  23.0  46000.0     Mumbai
9   10  26.0      NaN  Hyderabad
10  11   NaN  52000.0       Pune
11  12  30.0  60000.0     Mumbai
12  13  28.0  58000.0        NaN
13  14  22.0      NaN    Chennai
14  15   NaN  49000.0    Kolkata
15  16  27.0  53000.0       Pune
16  17  25.0      NaN     Mumbai
17  18  26.0  52000.0      Delhi
18  19   NaN  56000.0  Bangalore
19  20  24.0  48000.0        NaN

In [25]:
print("Missing vale Count: ",df.isnull().sum())

Missing vale Count:  id        0
age       5
salary    5
city      3
dtype: int64

In [26]:
df_remaove=df.dropna()
df_remaove

    id   age   salary    city
0    1  24.0  45000.0  Mumbai
1    2  27.0  54000.0   Delhi
5    6  29.0  58000.0   Delhi
8    9  23.0  46000.0  Mumbai
11  12  30.0  60000.0  Mumbai
15  16  27.0  53000.0    Pune
17  18  26.0  52000.0   Delhi

In [27]:
df['age'] = df['age'].fillna(df['age'].mean())
df['salary'] = df['salary'].fillna(df['salary'].mean())

In [30]:
df['city'] = df['city'].fillna(df['city'].mode()[0])

In [31]:
df

    id        age   salary       city
0    1  24.000000  45000.0     Mumbai
1    2  27.000000  54000.0      Delhi
2    3  25.933333  50000.0  Bangalore
3    4  22.000000  52600.0     Mumbai
4    5  25.000000  61000.0     Mumbai
5    6  29.000000  58000.0      Delhi
6    7  31.000000  52600.0       Pune
7    8  25.933333  47000.0      Delhi
8    9  23.000000  46000.0     Mumbai
9   10  26.000000  52600.0  Hyderabad
10  11  25.933333  52000.0       Pune
11  12  30.000000  60000.0     Mumbai
12  13  28.000000  58000.0     Mumbai
13  14  22.000000  52600.0    Chennai
14  15  25.933333  49000.0    Kolkata
15  16  27.000000  53000.0       Pune
16  17  25.000000  52600.0     Mumbai
17  18  26.000000  52000.0      Delhi
18  19  25.933333  56000.0  Bangalore
19  20  24.000000  48000.0     Mumbai

In [32]:
print("\nMissing Values After Imputation:\n", df.isnull().sum())

Missing Values After Imputation:
 id        0
age       0
salary    0
city      0
dtype: int64